run/porousPimpleFoam/case_documentation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


h       100;         //heat transfer coefficient (W/(m^2 K))
rp      0.005;       //particle radius (m)

// Fluid

rhof    1.2;        //fluid density (kg/m^3)
cpf     700;        //fluid specific heat capacity (J/(kg*K)
kf      0.06;       //fluid thermal conductivity (W/(m*K)

mu      1.825e-05;
Tmu     293;
mu2     1.963e-5;
Tmu2    343;

//Source for mu temperature dependency:
//https://www.engineersedge.com/physics/viscosity_of_air_dynamic_and_kinematic_14483.htm

// Solid

rhos    5150;       //stone density (kg/m^3)
cps     1130;       //stone specific heat capacity (J/(kg*K)
ks      0;        //stone phase effective thermal conductivity (W/(m*K)