run/porousPimpleFoam/case_documentation/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir
touch case.foam
python3 createMesh.py
runApplication blockMesh
runApplication setFields
#runApplication $(getApplication)

runApplication decomposePar
runParallel $(getApplication)
#runApplication reconstructPar

#------------------------------------------------------------------------------
